[
    {
        "time": "2011-12-30",
        "text": "You need to pay for the internet (2 euro / half-hour or 6 euros per day), breakfast is pretty dull, but location is really close to the metro station (L3 line - Mundet). Staff was friendly and helpful !",
        "rating": 4,
        "place_name": "ALIMARA",
        "place_category": "accommodation"
    },
    {
        "time": "2012-09-26",
        "text": "For &quot;free&quot; WIFI in the lobby you have to register with your passport ID! Otherwise a clean and nice hotel.",
        "rating": 4,
        "place_name": "ALIMARA",
        "place_category": "accommodation"
    },
    {
        "time": "2013-11-11",
        "text": "A wonderful place for students, professionals, researchers and all people. Is quiet, beautiful and nice. Conffortable rooms, good and varity food. You can visit diferents incredibles places. Is located in the montain so the weather is cooler. You take the L3 of the subway and stop at the Mundet station and them cruise the Can de Marcet Avenue. I really like this place.",
        "rating": 5,
        "place_name": "Agora BCN",
        "place_category": "accommodation"
    },
    {
        "time": "2013-02-28",
        "text": "Very simply furnished room (no TV, fridge or anything), however nice and clean- who does need more? Excellent breakfast (earlier you get to the restaurant the more variety of food you have to chose from) Only issue is that the complex is located outside city center (20-25 min by metro) and can be little tricky to find at the first time. PRICE/VALUE RATIO is unbeatable. All we needed was a nice, clean, safe place with breakfast. We have been spending whole day in the city so distance was not a problem either.",
        "rating": 4,
        "place_name": "Agora BCN",
        "place_category": "accommodation"
    },
    {
        "time": "2013-07-26",
        "text": "Nice place for young people",
        "rating": 4,
        "place_name": "Agora BCN",
        "place_category": "accommodation"
    },
    {
        "time": "2011-11-19",
        "text": "It was far from the center on Barcelona ... but with nice service and great price :D",
        "rating": 4,
        "place_name": "Inout Hostel",
        "place_category": "accommodation"
    },
    {
        "time": "2011-06-27",
        "text": "This was easily one of the best hostels I have been to in Europe. At first, the metro can be a little overwhelming, but easily understandable with the correct directions. The hostel is a little hike from the metro too. The accommodations were great and the staff were very friendly and helpful.",
        "rating": 5,
        "place_name": "Inout Hostel",
        "place_category": "accommodation"
    },
    {
        "time": "2011-06-16",
        "text": "Okay, it&#39;s not cheap but if you want to see Barcelona, there is nowhere better.",
        "rating": 5,
        "place_name": "Gran Hotel La Florida",
        "place_category": "accommodation"
    },
    {
        "time": "2012-08-09",
        "text": "A bit far from city centre but on an elevated position that guarantee cooler temperature and an nice view. Swimming pool is much smaller than expected, deep only 1m; also the room is not very big but the balcony (as big as the bedroom) with two deckchairs makes up for that. Brekfast a bit expensive but worth it, cheeper if booked for every day. Nice experience but often too noisy because of other turists",
        "rating": 4,
        "place_name": "Catalonia Park Güell",
        "place_category": "accommodation"
    },
    {
        "time": "2013-09-20",
        "text": "I had a lovely visit at Amiga Barcelona. Margarita, Carlos and all of the staff were beyond expectations - warm, caring and attentive. The breakfast was superb!!! And my room was plain, but elegant. This B&amp;B is full of old world charm. I can not say enough good things about being there. I stayed at 5 different places during my trip to Spain and France. This one was by far the best.",
        "rating": 5,
        "place_name": "Bed and Breakfast Amiga Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2011-06-20",
        "text": "LOVED IT!! LOVED IT!! LOVED IT!! Felt like at home. Margarita welcomed us with a cold beer, then sat down with us to talk about places to go see and restaurants to go eat. The room was really clean and the bed was very comfortable. It&#39;s conveniently located (about 5 min walk from the metro station station and 10 min walk to Parc Guell) and in about 15-20 minutes we were in the Barri Gotic in the heart of Barcelona. Free Wi-Fi, an amazing breakfast (included) and the reasonable price made it even better!",
        "rating": 5,
        "place_name": "Bed and Breakfast Amiga Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2012-03-07",
        "text": "Margarita&#39;s place is the most lovely hotel I ever stayed at in Barcelona, it was such a pleasure to visit! I have never had such wundervoll, rich and great breakfast and enjoyed the calm and piece and warmth of the art deco house and the streets on the old hill. The place is close to the metro and has the great advantage to be calm and with a very good, personal atmosphere. The price is extremely generous for the location and the experience of this beautiful house.",
        "rating": 5,
        "place_name": "Bed and Breakfast Amiga Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2008-03-03",
        "text": "What a fantastic find! Great value and wonderfully situated for the city centre and the main attractions. The owner, Margarita, makes you feel right at home immediately and the breakfast spread in the beautiful dining room is unmissable! The rooms and bathrooms were very clean and, compared to some other places I have stayed in Barcelona, the price was great value. I would definitely recommend this place to friends and, in fact, am heading back there shortly myself!",
        "rating": 5,
        "place_name": "Bed and Breakfast Amiga Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2010-02-20",
        "text": "I spent 1 week in BCN for business and in Amiga I found a warm place with all facilities to do my job afther meetings,with internet conection and a quite place to work in the evening. Amiga is not in the center but the undergraund is just few minutes walking and you can reach the city centre in no more that 15 minutes. The owner is charm, warm and polite,the rooms are clean, breakfast is complete.The enviroment is like to be at home and the rate is very competitive. Conclusion 10 points over 10.",
        "rating": 5,
        "place_name": "Bed and Breakfast Amiga Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2013-02-23",
        "text": "Great hostel to stay in, even for families. The hostel is very clean and the staff very warming and friendly. When I arrived, one of the staff checked me in, gave me a map and pointed all the places I should go visit the next day, which I did. The breakfast was basic, bread with jam/butter, coffee/tea/hot chocolate, orange juice. They do have a fridge to store your own food and a microwave. The location is in a neighborhood away from downtown Barcelona, but there is a bus stop and subway station nearby, within a few minutes walk. Worth the stay.",
        "rating": 5,
        "place_name": "Albergue Studio Hostel",
        "place_category": "accommodation"
    },
    {
        "time": "2013-04-16",
        "text": "Nice hostel! Rooms are clean, tidy and cozy, cleaned frequently. Breakfast are simple...even though they are the same everyday..they are filling...and nice...tea or coffee or cocoa with milk..and bread..with diff types of bread-spread for u to choose from. There is a fridge and 3 types of oven in the kitchen. The hostel is 3 storied...i think...but never had bathroom shortage problem...there are 2 or mayb 3 common bathrooms with toilet... Sara is so friendly and nice! She speaks english fluently...helped alot with places to go...and advices for trips... The hostel is abit far from city centre...but the metro station is very near to the hostel...around 5 min away...metro took around 30 minutes to reach central metro station for switching trains...early departure from hostel and starting your day early would cause no problem to your schedule at all... There is washing machine and dryer and iron and lockers... Overall this is an excellent hostel! Even better than a 3-stars Hotel i stayed few nights before in Prague...I would say this is a hostel-like 3 star Hotel! would definitely go back there if i were to go Barcelona again! :)",
        "rating": 5,
        "place_name": "Albergue Studio Hostel",
        "place_category": "accommodation"
    },
    {
        "time": "2013-06-11",
        "text": "I stayed at his hostel two years ago and I still remember nice atmosphere and helpful staff. Great place to stay, an excelent location nearby mountains.",
        "rating": 4,
        "place_name": "Albergue Studio Hostel",
        "place_category": "accommodation"
    },
    {
        "time": "2007-12-24",
        "text": "Hi Stayed there during the summer, excellent hostel, very colse to the city center, turist bus goes from Plaza sarria couple of minutes walk from the hostel. Very friendly staff.",
        "rating": 5,
        "place_name": "Albergue Studio Hostel",
        "place_category": "accommodation"
    },
    {
        "time": "2013-05-11",
        "text": "Carlos is the man. He helped us find the place at 3am. Great service.",
        "rating": 4,
        "place_name": "Husa Pedralbes",
        "place_category": "accommodation"
    },
    {
        "time": "2013-06-04",
        "text": "Clean, well serviced, mid-sized hotel. No boutique pretensions thankfully, despite being pretty modern design-wise and easy on the eye. An easy twenty minute stroll downhill to tons of popular bars/restaurants. Nice place.",
        "rating": 4,
        "place_name": "Silken St. Gervasi",
        "place_category": "accommodation"
    },
    {
        "time": "2009-04-28",
        "text": "The Silken St. Gervasi is a nice hotel in the city of barcelona. It is close to the subway (300m to Pudex L7), a ride to the city center takes only 12 minutes. My room was quite nice, tidy an so on. In sum I can recommend this hotel.",
        "rating": 4,
        "place_name": "Silken St. Gervasi",
        "place_category": "accommodation"
    },
    {
        "time": "2013-08-15",
        "text": "Quality service at low cost, friendly personnel.",
        "rating": 5,
        "place_name": "Hotel Eurostars Anglí",
        "place_category": "accommodation"
    },
    {
        "time": "2012-09-15",
        "text": "We were there on a business trip in 2008. The apartments are modern and clean, maybe a little bit on the small size. From the metro station down the road, you can get almost everywhere in the city.",
        "rating": 5,
        "place_name": "Apartamentos Descartes",
        "place_category": "accommodation"
    },
    {
        "time": "2013-08-14",
        "text": "Very nice hotel, located in a nice area, close to Park Güell. It was clean and the staff were very helpful. I loved the big terrace of the room. What I didn&#39;t like was that the bathtub had a glass side panel and it was a bit small for me. Also the hotel parking was full",
        "rating": 4,
        "place_name": "Hotel Eurostars Mitre",
        "place_category": "accommodation"
    },
    {
        "time": "2013-01-31",
        "text": "I was surprise for the price that I booked and expecting the worst, the hotel is cleaned, modern and the bedroom was great. If you are planning to use the metro, be ready to walk for 15 minutes, before you get there, but the staff was really helpful.",
        "rating": 4,
        "place_name": "Hotel Eurostars Mitre",
        "place_category": "accommodation"
    },
    {
        "time": "2011-09-18",
        "text": "Fine hotel with a better than average breakfast. Sweet and helpful employees. Very close to El Putxet subway station (L7). If possible ask for a room on the 5th floor; they have a balcony.",
        "rating": 4,
        "place_name": "Hotel Eurostars Mitre",
        "place_category": "accommodation"
    },
    {
        "time": "2013-02-11",
        "text": "Good location and very clean. It will be much more better if the house keepers could speak English....... Anyway, the breakfast is perfect.",
        "rating": 4,
        "place_name": "Casa Con Estilo",
        "place_category": "accommodation"
    },
    {
        "time": "2013-07-18",
        "text": "A very good experience for the price. The A/C worked really well and the shower was good. The WiFi worked, but it was of course quite slow (probably limited to 0.5/0.5 Mbps) and you had to ask for a new user account every 4 days, still better than nothing. It was good enough for checking email and light browsing, but not enough for video streaming etc. The neighborhood was really calm, but it is quite far from everything, about 1 km walk to the closest metro station.",
        "rating": 4,
        "place_name": "Hotel Ibis Barcelona Meridiana",
        "place_category": "accommodation"
    },
    {
        "time": "2010-11-19",
        "text": "IBIS standard quality and afforable pricing, but the location is remote so budget for a taxi.",
        "rating": 4,
        "place_name": "Hotel Ibis Barcelona Meridiana",
        "place_category": "accommodation"
    },
    {
        "time": "2013-02-11",
        "text": "A good place for the environment and the garden, which I personally like very much.",
        "rating": 4,
        "place_name": "Feetup Garden House Hostel Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2011-06-29",
        "text": "a really fun hostel. Loads of things to do and people to meet. The staff are really friendly and helpful too. Definitely one of the best places to stay in Barcelona.",
        "rating": 5,
        "place_name": "Feetup Garden House Hostel Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2011-05-01",
        "text": "Great place! Highly recommend it for tourists who want to relax in a clean, beautiful, well-organized hostel away from the noisy downtown core. There is an amazing park nearby where you can view the whole city. If you go to Barcelona for the sights, this is for you. If you go to Barcelona for the nightlife, find someplace downtown.",
        "rating": 5,
        "place_name": "Feetup Garden House Hostel Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2011-08-28",
        "text": "Garden House is a very nice hostel. Loved my time there! Thanks for the helpful and friendly staff and they have a great garden outside to relax and have the breakfast!",
        "rating": 5,
        "place_name": "Feetup Garden House Hostel Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2009-07-28",
        "text": "This was by far the best Hostel we visited on our trip! The staff is amazing and friendly. The facilities are so clean. They promot social activity.. its great! Stay here- you will not regret it!",
        "rating": 5,
        "place_name": "Feetup Garden House Hostel Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2013-08-22",
        "text": "Very Nice Hotel! Friendly staff always ready for help. The centre of Barcelona is easily reached by metro (10 minute walking distance). And the shoppingmall La Maquinista is next door. Less than a minute walking distance. Very Nice!",
        "rating": 5,
        "place_name": "NH La Maquinista",
        "place_category": "accommodation"
    },
    {
        "time": "2013-02-02",
        "text": "looking for shirley aline alvorado married william clough family lives in spain somewhere i remember our family came from spain because my grandmas sister passed of breast cancer.ñj0lllll",
        "rating": 5,
        "place_name": "BarcelonaYellow.com Guide",
        "place_category": "accommodation"
    },
    {
        "time": "2010-06-17",
        "text": "My boyfriend and I had the perfect vacation in Barcelona while staying at Catalonia Atenas. The staff were helpful, the breakfast was bountiful and delicious and the location was amazing (right next door to the Metro (Clot Station). The pool and sundeck was an added bonus and our room in the 6th floor was ample for the both of us (loved the bidet!). We booked through Air Transat so our hotel was included with the package and airfare...very affordable. I would definitely recommend to anyone who wants value, comfort and convenience. S&amp;M from Toronto, Canada",
        "rating": 5,
        "place_name": "Hotel Catalonia Atenas",
        "place_category": "accommodation"
    },
    {
        "time": "2013-02-03",
        "text": "Very Good hotel good location",
        "rating": 4,
        "place_name": "Acta INK606",
        "place_category": "accommodation"
    },
    {
        "time": "2013-09-02",
        "text": "Good prices but loud",
        "rating": 4,
        "place_name": "Hotel Medium Abalon",
        "place_category": "accommodation"
    },
    {
        "time": "2013-05-19",
        "text": "I stay here these days. The mansger is very warm and kind however, she can speak only spanish. Most of facilities are good and clean.",
        "rating": 4,
        "place_name": "Hotel Everest",
        "place_category": "accommodation"
    },
    {
        "time": "2011-10-15",
        "text": "Modern, very clean, friendly; metro nearby",
        "rating": 5,
        "place_name": "Hotel Medicis",
        "place_category": "accommodation"
    },
    {
        "time": "2013-03-18",
        "text": "Perfect for 53€ per night. Even with free WIFI.",
        "rating": 4,
        "place_name": "Hotel Aristol",
        "place_category": "accommodation"
    },
    {
        "time": "2013-07-08",
        "text": "Excellent apartment.Clean and all necessary facilities.Would recommend.Would love to return.",
        "rating": 5,
        "place_name": "Eric Vökel Suites",
        "place_category": "accommodation"
    },
    {
        "time": "2012-02-13",
        "text": "Great quality at very competitive rates. Very well located.",
        "rating": 5,
        "place_name": "Eric Vökel Suites",
        "place_category": "accommodation"
    },
    {
        "time": "2011-09-28",
        "text": "Enjoyed staying here, even though it was just one night. The hostel is very well organised, provides you with laundry machine, refrigerator, fully equipped kitchen and a couple more things. Staff is very friendly and helpful, rooms are clean and spacious enough. Unfortunately, the hostel doesn&#39;t have the best place - there is no problem living a bit far from the city centre, as the metro station is not far away, but it seems to be the highest point in town. It becomes a serious problem when carrying a large backpack. This hardship, however, is compensated by very cheerful and helpful service who aids you as soon as you enter the hostel. Otherwise great and I really recommend it.",
        "rating": 4,
        "place_name": "Feetup Mellow Eco Hostel Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2011-08-19",
        "text": "I loved my stay in Mellow hostel in Barcelona. The staff was so helpful and alwasy smiling:) They have a big kitchen so it´s nice to cook and eat in the hostel. Also sometimes they have paella nights or burgers that are delicios! The view from there is so beautiful, you can see to the see and to the city. I hope I can return soon:) See you Mellow!",
        "rating": 5,
        "place_name": "Feetup Mellow Eco Hostel Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2010-11-19",
        "text": "This guys rock. Located on a top of a mountain where you can run away from the madness of Barcelona and enjoy the best views of the city. There is one point of the way where you can see the entire Barcelona and the sea. They are Eco friendly and the staff is just the best!!! Very clean and secure with a bust just right in front of the door. Loved their movie selection and the fully equipped kitchen. Best Hostel where I have been...",
        "rating": 5,
        "place_name": "Feetup Mellow Eco Hostel Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2011-03-29",
        "text": "amanzing hostel!! i love days in here!! wonderfull staff, that always try to help you with everything!! they organize nights with pub crowls and it&#39;s really easy to meet nice people and have a great time and fun. i just felt like home!",
        "rating": 5,
        "place_name": "Feetup Mellow Eco Hostel Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2010-10-16",
        "text": "The hostel is a bit more quiet than most, so it is a good spot for those seeking to avoid festivities. Checking in was truly a pleasure; I can say with assurance that the staff ranks 5 star in terms of service. The hotel was very clean and safe. Definitely worth staying.",
        "rating": 5,
        "place_name": "Feetup Mellow Eco Hostel Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2009-02-18",
        "text": "I studied Spanish at UAB for a period of 3 months and it wasa great experience. I learned a lot although it can be a bit confusing that there are two official languages in Barcelona (Spanish and Catalan). In any case Barcelona is a wonderful city where there is always something going on.",
        "rating": 4,
        "place_name": "Barcelona-University.es",
        "place_category": "accommodation"
    },
    {
        "time": "2012-11-02",
        "text": "Great value for money, clean rooms, WiFi worked fine - even in our room, guess we were lucky (normally only in the reception area if I got it right). Very friendly staff, everyone we met answered all our questions and knew what they were talking about. The surrounding area is really nice, lots of restaurants and bars away from the tourist traps. Five minutes walk to the closest Metro station and the ride to the city center is not much longer.",
        "rating": 4,
        "place_name": "Residència Erasmus Gràcia",
        "place_category": "accommodation"
    },
    {
        "time": "2013-10-14",
        "text": "We are here today! The hotel is very clean and pleasant, we like it!",
        "rating": 4,
        "place_name": "Hotel Lesseps",
        "place_category": "accommodation"
    },
    {
        "time": "2013-08-25",
        "text": "Cool hostel in an authentic neighborhood ! I recommend this place if you are traveling alone, you will meet people from all over the world quite easily... awesome staff and clean facilities",
        "rating": 5,
        "place_name": "Sant Jordi Hostel Gracia",
        "place_category": "accommodation"
    },
    {
        "time": "2013-10-19",
        "text": "Always delicious and affordable. One if the loveliest places to pick a take away or enjoy a healthy lunch in the Gracia neighbourhood.",
        "rating": 5,
        "place_name": "Les Tres a La Cuina",
        "place_category": "accommodation"
    },
    {
        "time": "2013-05-16",
        "text": "Excellent rooms, service, facilities, decor, breakfast, etc. Only conspicuous negative (for me) was the patchy WiFi connectivity. There&#39;s free best-effort service throughout the hotel and a paid service but neither of those worked consistently or reliably enough. Also the gym was pretty minimal.",
        "rating": 5,
        "place_name": "Astoria",
        "place_category": "accommodation"
    },
    {
        "time": "2012-07-25",
        "text": "The standard rooms are nice and airconditioning works well. Wifi in rooms cost, and have different plans depending on for how long. However you have 90 free minutes of free wifi every day in your room. But there is free wifi in the lobby and on the roof-terrace, you have to ask in the reception for the password. Also there is a Starbucks within a 15 minute walk. Service seems alright, but some of them don&#39;t talk english very good, so be aware. All in all I think it is great.",
        "rating": 4,
        "place_name": "Astoria",
        "place_category": "accommodation"
    },
    {
        "time": "2010-10-02",
        "text": "Helpful, responsive staff, tasty buffet breakfast, nice rooms w/ modern theme (both of our rooms had windows looking in, so not a view, we had double beds), overall, quiet, restful place. This hotel is located in an area of apartments, businesses, shops, cafes and restaurants (more Diagonal district then Eixample). Across the street is a dance club, down the street is a small playground for children. A good slice of life. Balmes, Gracia and Diagonal streets are close-by w/ restaurants and shops. We took the bus (stop right across hotel), we walked to the metro - very close by. We often ate in nearby cafes - La Flauta and Cafe Paris - good, cheap tapas. Would totally go back. Away from the big tourist crowds.",
        "rating": 5,
        "place_name": "Astoria",
        "place_category": "accommodation"
    },
    {
        "time": "2009-07-20",
        "text": "Excellent service, great food for breakfast, very clean rooms, free internet. After traveling throughout Spain for two weeks, a stay at Astoria in Barcelona was a pleasant surprise. I would highly recommend this place to anybody.",
        "rating": 5,
        "place_name": "Astoria",
        "place_category": "accommodation"
    },
    {
        "time": "2011-04-01",
        "text": "Very clean room. Great front desk service. Close enough to all the sites without being too busy.",
        "rating": 4,
        "place_name": "HCC Covadonga",
        "place_category": "accommodation"
    },
    {
        "time": "2013-11-05",
        "text": "Great location , comfortable 3 person room, centrally located yet quiet.",
        "rating": 5,
        "place_name": "HCC Covadonga",
        "place_category": "accommodation"
    },
    {
        "time": "2013-11-05",
        "text": "Great location and extremely good value",
        "rating": 5,
        "place_name": "HCC Covadonga",
        "place_category": "accommodation"
    },
    {
        "time": "2013-10-24",
        "text": "A quite hotel in the main street of Barcelona (Avinguda Diagonal), good for the family, a just 10 min far away from the center by Taxi",
        "rating": 4,
        "place_name": "Wilson Boutique Hotel",
        "place_category": "accommodation"
    },
    {
        "time": "2011-03-23",
        "text": "2 night stay at this hotel and found it to be very comfortable and stylish for a cheap priced hotel. The staff were very friendly and helpful and the place was spotless. The location was ok bang in the middle of the shopping mile. The metro 5 mins walk star de catyluna (city centre) 30 mins, just remember on the way back its uphill. The bus stops are nearby and if you have a map the bus can take you anywhere. Would reccomend using the touristic bus get a 2 day ticket hop on and off as much as you like its easier than the metro. Back to the hotel will definately be abck later in the year.",
        "rating": 4,
        "place_name": "Wilson Boutique Hotel",
        "place_category": "accommodation"
    },
    {
        "time": "2013-07-16",
        "text": "Friend staff, nice rooms, great location at a competitive price. Will be coming back here again.",
        "rating": 4,
        "place_name": "Hotel Alberta Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2011-11-28",
        "text": "10mbit download speeds via public wifi. Nice rooms!",
        "rating": 4,
        "place_name": "Aparthotel Mariano Cubi",
        "place_category": "accommodation"
    },
    {
        "time": "2010-09-01",
        "text": "I stayed at this hotel from August 20th till August 25th 2010. It was a delight. Never been in a better hotel so far. The rooms are big, large I could say. Excellent service. I recommend that you take the breakfast pack because you&#39;ll end up much cheaper than just paying there for it. The hotel is close to whatever you want to visit. Just take the subway and you are there. It&#39;s close to the Avenida Diagonal street and from there you can visit La Pedrera and other sites. Breakfast is diverse and delicious. Oh! Not to forget about the staff. They are very helpful. Whatever information you might need just ask and they will help. They also have tickets at the hotel for the main attractions. so if you by from the hotel you don&#39;t have to wait in line for buying one. We thought it&#39;s not necessary when we went to teh Sagrada Famillia and we ended up staying about 15 minutes on the line. I thought Barcelona would be more spectacular, but it wasn&#39;t. So I would come back to Barcelona only to see what I&#39;ve missed and I would defenely stay at Aparthotel Mariano Cubi. It&#39;s in the city center, but on a quite street. By the way, the rooms are exactly what you see in the pics. Great, great hotel!",
        "rating": 5,
        "place_name": "Aparthotel Mariano Cubi",
        "place_category": "accommodation"
    },
    {
        "time": "2013-07-26",
        "text": "For declared 3 star hotel is excellent. Staff is understanding English very well and is helpful. Location also was perfect, as it was close to Diagonal, which was helping not to get lost in the city. From hotel walk to Sagrada Familia was taking around 15 minutes. Rooms are very comfortable, cleaning also was at very high level. Loved this hotel, for next visit to Barcelona will definitely book it again",
        "rating": 5,
        "place_name": "Condado",
        "place_category": "accommodation"
    },
    {
        "time": "2013-07-23",
        "text": "Excellent hotel with rooms clean and of adequate size. Use of computer in foyer a bonus and all staff friendly and helpful. Only criticism is the breakfast is very over priced. Bar on opposite corner particularly good value. Found taxis when ordered through hotel more expensive than when &quot;flagged down&quot; nearby. This is because meter is started when they get the call rather than when you stop one in the roads nearby.",
        "rating": 4,
        "place_name": "Condado",
        "place_category": "accommodation"
    },
    {
        "time": "2013-07-14",
        "text": "Great hotel in a good location. 30/40 min walk to beach. Very kind staff.. Comfy beds. Very clean rooms. Plenty of space for 2 people. Free WiFi and use of computers and printer. Option for a buffet breakfast for extra charge. Some excellent restaurants nearby, about 5-10 min walk. Other cafes and boutiques in surrounding streets. Would highly recommend to others. Thoroughly enjoyed our stay.",
        "rating": 4,
        "place_name": "Condado",
        "place_category": "accommodation"
    },
    {
        "time": "2013-05-12",
        "text": "Good hotel for the price. Rooms were clean and in good shape. Front desk staff were friendly and helpful. Found some good restaurants within about a 10 minute walk. There is a subway stop within a 10 minute walk or if you don&#39;t mind walking a bit more a lot of the popular sights (La Sagrada Familia, La Rambla, Parc Güell, etc.) were within about a 20 - 30 minute walk.",
        "rating": 4,
        "place_name": "Condado",
        "place_category": "accommodation"
    },
    {
        "time": "2013-06-24",
        "text": "Need to admit that service is top class, all is tidy, clean. Would recommend to anyone who wants to be in a walking distance to all Barcelona&#39;s germs :)",
        "rating": 4,
        "place_name": "Condado",
        "place_category": "accommodation"
    },
    {
        "time": "2011-05-14",
        "text": "Friendly Staff, helpful front desk, great breakfasts, dinner not so great. Comfortable rooms with WiFi. Short walk to city centre. Three thumbs up!",
        "rating": 4,
        "place_name": "Hotel Zenit Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2013-01-13",
        "text": "I have opportunity to stay in hotel Guillermo Tell, it is an excellent place to stay. I love the clean environment, the WiFi service is very good.",
        "rating": 5,
        "place_name": "Hotel Guillermo Tell",
        "place_category": "accommodation"
    },
    {
        "time": "2013-07-06",
        "text": "Accommodation not far away from center with low price and perfect room quality.",
        "rating": 5,
        "place_name": "Hotel Guillermo Tell",
        "place_category": "accommodation"
    },
    {
        "time": "2009-05-25",
        "text": "My girlfriend and I just returned from a week in Barcelona where we stayed in Guillermo Tell. It is a lovely hotel, clean and have friendly staff. I will highly recommend this hotel since it is situated in a well connected part of the city.",
        "rating": 5,
        "place_name": "Hotel Guillermo Tell",
        "place_category": "accommodation"
    },
    {
        "time": "2013-07-02",
        "text": "We stayed 6 nights in June 2013. The hotel&#39;s position is excelent, 20 minutes walking distance to the Gaudi&#39;s Casa Mila and Casa Batllo. Also there are some supermarkets near. The personal is really friendly. They helped us by sending the itinerary from the airport to the hostel. We also received free maps and discounts. Even though we had a room without bath, this wasn&#39;t disturbing. The toilets and the showers were very clean, like the rest of the hostel. I will return there with great pleasure.",
        "rating": 5,
        "place_name": "Alogar",
        "place_category": "accommodation"
    },
    {
        "time": "2012-01-24",
        "text": "Our family stayed here in 2009 and we were extremely pleased. The rooms, which are small but efficient, were clean and pleasant. The location is superb - easy access to public transit, good for walking to tourist sites, in a safe area, convenient parking, and convenient to groceries and restaurants. The staff was superb - helpful and charming. All this, and incredibly affordable. Unless you&#39;re looking for luxury as your top priority, Aparthotel Silver is highly recommended.",
        "rating": 4,
        "place_name": "Aparthotel Silver",
        "place_category": "accommodation"
    },
    {
        "time": "2010-03-05",
        "text": "My brother and I stayed in the room adjacent to the office. It had a great balcony overlooking the street which was a bit noisy, but at the same time desirable in the way that it allowed us to look out onto the neighborhood, open up the room to some sunlight and enjoy the crisp Barcelona air. The train station was very convenient and located about a block away. We walked from our hostel to Parc de Guell, then onto La Segrada and even took a stroll down to the beach. It&#39;s a straight shot down Gran de Gracia and it&#39;s nearly impossible to get lost if you don&#39;t know your way around like we didn&#39;t. The staff were very friendly and I was even able to pay a little extra for wifi internet which was key for accessing email from my laptop. The room was clean (not white gloves clean, but clean enough for me and this coming from someone who vaccums their house 3 times a week!). The shared bathroom and shower were always clean and private. I&#39;m not one to like to share bathrooms and was very surprised how &#39;ok&#39; I was with it. There is a sink and mirror in the bedroom where you can wash up too. Overall very happy with the experience. Considering the many hostels I&#39;ve been in and stayed at from the U.S. to Asia, this one gets a thumbs up from me!",
        "rating": 4,
        "place_name": "Hostal San Medin",
        "place_category": "accommodation"
    },
    {
        "time": "2012-01-23",
        "text": "Unfortunately, the hostel closed last November",
        "rating": 4,
        "place_name": "Hostal San Medin",
        "place_category": "accommodation"
    },
    {
        "time": "2011-02-18",
        "text": "Fist time staying in hostal. Came for MWC event and was pleasantly surprised. Rooms, bathrooms and corridors are cleaned every day, staff is polite and helpful. If you do not mind sharing a bathroom with others (and there are several bathrooms here, so you don&#39;t ever wait in line), it is a great place to stay. Easy access to the city center (bus 58 or metro) makes it a great place to stay.",
        "rating": 5,
        "place_name": "Hostal Valls",
        "place_category": "accommodation"
    },
    {
        "time": "2011-09-16",
        "text": "Thank you Mayan Urban Spa for the unforgettable experience! Definitely not my last time at your spa. Keep up with the good work and see you soon! :)",
        "rating": 5,
        "place_name": "Mayan Urban Spa",
        "place_category": "accommodation"
    },
    {
        "time": "2013-11-21",
        "text": "Bienvenidos al hostal Barcelona City Street, un hostal urbano y familiar para disfrutar de tu alojamiento en Barcelona! Welcome to Barcelona City Street, a Bed and Breakfast urban and family to enjoy your stay in Barcelona!",
        "rating": 5,
        "place_name": "Barcelona City Street",
        "place_category": "accommodation"
    },
    {
        "time": "2010-09-01",
        "text": "Engrande is the best travel agency in the world. We are accomodation provider in Central London and we have contact with a lot of agencies from around the world but Engrande is truly the best in the world. This is because their system is exceptionally user friendly, their exposure is vast and they have excellent people like Mr. Vincent Das. If there are any problems, they sort out very quickly and in an efficient manner. The guests who book with engrande are very happy with their service as well. After all they are unique as they are the only one who have videos of accomodations on their website!!!",
        "rating": 5,
        "place_name": "EnGrande SL",
        "place_category": "accommodation"
    },
    {
        "time": "2010-08-17",
        "text": "Hi, I would like to thank you for you kind support and the quick response we have from your team. I don&#39;t have a lot of time because I have a full time job so I was surprised when I had an issue with a double booking and how quick the response was. The guest did not relies the changes on the background. The booking program is excellent and I&#39;ve recommended you to my friends and other hotel business in the UK. Keep up the good work! Saludos, Rafael",
        "rating": 5,
        "place_name": "EnGrande SL",
        "place_category": "accommodation"
    },
    {
        "time": "2011-08-03",
        "text": "Wine Tour and Team Building - Barcelona Event Organisation. My Company SCOTCHILE.UK decided to hold a team building eventin Barcelona to help bond our employees and boost morale and working mentality within the Company.I must stress this was a big decision as we had no previous experience and did not speak the local language. A big thank you to B.E.O for organising an excellent Wine Tour at Torres followed by a very enjoyable small. Treasure Hunt in the centre of Barcelona,finishing off with a fantastic dinner at La Fonda restaurant in the Port Olimpic.We will never forget this bonding experience and we could not have done without the excellent help of B.E.O whose staff were first class and always willing to help us out and even go further than what was required.We will be using you again and i will also be recommending you to other U.K and European companies which i do Business with on a regular basis.Morale and productivity has certainly improved in our workplace.Big thanks again B.E.O. You guys were awsome.",
        "rating": 5,
        "place_name": "Barcelona Event Organisation",
        "place_category": "accommodation"
    },
    {
        "time": "2009-07-22",
        "text": "We staid in the apartment Calabria - Diputacion it was very nice! The place of the apartment is very good and convenient, very good facilities. We had a great time and will tell more people to come and visit.",
        "rating": 5,
        "place_name": "Rent 4 Days",
        "place_category": "accommodation"
    },
    {
        "time": "2011-10-20",
        "text": "This 5-star hotel is definetly worth a trip to see the spectacular infinity pool. Be aware that a glass of house wine is 12€",
        "rating": 4,
        "place_name": "Casa Fuster",
        "place_category": "accommodation"
    },
    {
        "time": "2013-04-24",
        "text": "Great hotel in Barcelona. Book in advance for discounts.",
        "rating": 5,
        "place_name": "Gallery Hotel",
        "place_category": "accommodation"
    },
    {
        "time": "2013-08-04",
        "text": "This is by far one the best hotels we have ever stayed in. The service was exceptional. Every question we had they patiently helped us with. When we wanted tickets printed for various things we were going to do, they would print it for us and deliver to our room. The location is also a bonus since it is central to many things like La Padrera, Nou Camp (if there is a game on, it is a must to watch it), Sagrada Familia, La Ramblas and so on. There are buses that go to all of these places for 2 euro per person one way and are very easy to look up on Google. We got around for 5 days without getting lost and only taking a cab twice. There is a little bit of noise from the street, but should not bother people at all. For breakfast we would walk down to the pans and company, about 2 blocks away, every morning for a very delicious meal and coffee and its a fair price. The gym actually has proper equipment and the rooftop pools are nice in summer. We could not have asked for more here and really hope others will stay here.",
        "rating": 5,
        "place_name": "Hotel Condes de Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2012-03-21",
        "text": "The location is perfect and the staff are very friendly. The rooms vary from classic to modern.",
        "rating": 4,
        "place_name": "Hotel Condes de Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2011-11-08",
        "text": "Very nice place to stay. Clean accomodations. Kitchen, Fridge, TV lounge, Wi-Fi, WCs. Guillermo is a great nightlife guide. Good location.",
        "rating": 5,
        "place_name": "Hotel Paseo De Gracia",
        "place_category": "accommodation"
    },
    {
        "time": "2011-02-28",
        "text": "Excellent location, good service. Rooms a bit cramped tho.",
        "rating": 4,
        "place_name": "Hotel Majestic",
        "place_category": "accommodation"
    },
    {
        "time": "2011-07-29",
        "text": "Location Location Location! And also great views from the rooftop terrace... Deluxe room is rather small but nicely decorated. Marble bathrooms and rooms decorated in white and bright colors.",
        "rating": 5,
        "place_name": "Hotel Majestic",
        "place_category": "accommodation"
    },
    {
        "time": "2012-12-01",
        "text": "immaculate location, clean and tidy room...very nice view!",
        "rating": 4,
        "place_name": "Hotel Murmuri",
        "place_category": "accommodation"
    },
    {
        "time": "2013-03-21",
        "text": "Hotel Omm is a 5-star hotel in Barcelona. It is ideally located in the elegant Eixample district. It is an impressive example of Catalan hotel design, steps from Diagonal metro and just a few minutes&#39; walk from Gaudí&#39;s La Pedrera.",
        "rating": 4,
        "place_name": "Hotel Omm Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2010-09-19",
        "text": "One of the best meals we had in Spain during our 2 week trip to Barcelona, Bilbao, Santander, San Sebastian and St. Jean de Luz (France). While it was a bit pricey, the quality was extraordinary. The dover sole was oustanding. The appetizers and deserts devine. The sommelier was the best we&#39;ve had anywhere in the world.",
        "rating": 5,
        "place_name": "Hotel Omm Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2010-11-24",
        "text": "Stylish and modern hotel with a great vibe, centrally located in the heart of the shopping district and boutiques of Paseo de Gracia. The lobby lounge is a convenient place to meet friends for drinks.",
        "rating": 5,
        "place_name": "Hotel Omm Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2012-03-03",
        "text": "Had dinner at the MOO restaurant , a very nice experience to taste a suggested by the chef matching wine for every dish . I strongly recommend",
        "rating": 5,
        "place_name": "Hotel Omm Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2011-11-20",
        "text": "Great location,very nice terrace restaurant. Breakfast buffet dull. Nice rooms, however there is still room for improvement if the hotel is to be considered 5* even in the suites.",
        "rating": 4,
        "place_name": "Hotel Claris",
        "place_category": "accommodation"
    },
    {
        "time": "2013-12-08",
        "text": "Stayed with my 3 children and they loved it, people are really friendly and helpful, great place!",
        "rating": 5,
        "place_name": "Casa Gracia",
        "place_category": "accommodation"
    },
    {
        "time": "2013-07-07",
        "text": "quite nice but it is needed to restore",
        "rating": 4,
        "place_name": "Hostal H.m.b.",
        "place_category": "accommodation"
    },
    {
        "time": "2011-10-17",
        "text": "Rooms are a bit small but very usefull. The location of the hotel is sublime",
        "rating": 5,
        "place_name": "HCristina",
        "place_category": "accommodation"
    },
    {
        "time": "2009-02-24",
        "text": "I stayed at Nisia in August 2008. At the time Alex &amp; Carina (the original owners) were in charge and they&#39;re very helpfull &amp; extremely nice people. It was my 1st time travelling alone so their advice &amp; tips on the city&#39;s sites and local cuisine were very wonderful! The rooms are cosy, clean &amp; tidy, and also cleaned every day. The shower was a bit small but clean. You have everything you need for a comfortable stay. The location of the B&amp;B is amazing, close to the city&#39;s centre (Placa de catalunya, Ramblas, harbour etc.), the subway &amp; several buslines are only a couple of minutes walking away. On top of all this I was very lucky because I stayed there during the Gracia-festival which is always in the 3rd week of August. The neighbourhood is very much alive than, at the evening/night there are always many things to do, lovely restaurants to go to, performances and concerts to see etc.",
        "rating": 5,
        "place_name": "Nisia Bed & Breakfast",
        "place_category": "accommodation"
    },
    {
        "time": "2013-05-03",
        "text": "great place! very clean rooms and friendly service!",
        "rating": 5,
        "place_name": "Duo By Somnio Hostels",
        "place_category": "accommodation"
    },
    {
        "time": "2012-08-20",
        "text": "I&#39;m from Amsterdam and it was the first time I booked a room at a hostel. I had booked only for one day but at the same day I met really nice people so I booked one more day, and then an another day haha (3 nights). The service was very good, there was a good atmosphere in the hostel and at a good spot. A special SHOUT OUT to Greg!! Had a great time at my first time in Barcelona!",
        "rating": 5,
        "place_name": "Sant Jordi Diagonal",
        "place_category": "accommodation"
    },
    {
        "time": "2013-06-27",
        "text": "Good location, good value for money, great for self-catering travellers, ladies who run that place could speak a little bit better English (or I should have learned some Spanish ;) In general it is decent place to stay for couple of nights.",
        "rating": 4,
        "place_name": "Residencia d´Estudiants Nuria",
        "place_category": "accommodation"
    },
    {
        "time": "2012-12-11",
        "text": "By far one of the best hostels in Barcelona. Excellent location and best value and quality of service made my experience in Barcelona amazing. The staff is very helpful and always ready to show a smile and a joke with very useful tips... very recommended!! the neighbourhood is very nice and calm, perfect for barcelona, as you walk 10 minutes and you are in the hearth of the city most attractive spots.",
        "rating": 5,
        "place_name": "Gràcia City Hostel Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2013-05-06",
        "text": "Awesome, great people, great location, great price, facundo helps you with anything at any time since he manages to sleep about 20 minutes a day ;)",
        "rating": 5,
        "place_name": "Gràcia City Hostel Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2013-11-06",
        "text": "Definitely my favorite place in Barcleona. Great Staff, great facilities, amazing terrace. Right in the city center!",
        "rating": 5,
        "place_name": "Rodamón Hostel",
        "place_category": "accommodation"
    },
    {
        "time": "2013-10-30",
        "text": "These guys are great, i have used them twice and i have never been desappointed and when i needed something they did their best to help me! I loved the location of the flats on Santa Tacla was a great location close to everything with some nice little restaurants and shops! I always prefer renting a flat in Barcelona so you feel like you live there and its nice to have your own privacy!",
        "rating": 5,
        "place_name": "ApartEasy Apartments",
        "place_category": "accommodation"
    },
    {
        "time": "2013-03-31",
        "text": "Great value. Really nice room: well-designed, clean and new-looking. Wifi worked fine. Didn&#39;t have breakfast so can&#39;t comment. Staff were friendly and helpful.",
        "rating": 4,
        "place_name": "Hotel Sagrada Familia",
        "place_category": "accommodation"
    },
    {
        "time": "2012-12-26",
        "text": "Great modern hotel right in the center of the old city. Breakfast is ok, rooms are very clean and pool on the roof is very relaxing. 24 hour service at the desk and very friendly and helpful people. Overall great hotel!",
        "rating": 4,
        "place_name": "Hotel Sagrada Familia",
        "place_category": "accommodation"
    },
    {
        "time": "2012-07-05",
        "text": "We stayed in Barcelona for 7 days and it was wonderful. We had a room with 3 single beds and shared facilities. The room was small, but had everything we needed, a safe, fan, AC, fridge and microwave. Breakfast was plentiful. The location was also good, we were in walking distance of the Sagrada Familia (10 min) and Park Guell (15-20 min) and several metro stations. We even walked to Pg de Gracia and La Rambla (30-40 min) and Torre Agbar. The streets are laid out in grids so it&#39;s easy to navigate and the B&amp;B offers several maps you can borrow. Most of all, the service was great. Tina and Jose were very kind and helpful and I thought they were very honest and trustworthy.",
        "rating": 5,
        "place_name": "Barcelona Rooms 294",
        "place_category": "accommodation"
    },
    {
        "time": "2012-06-18",
        "text": "We spent 3 days in Barcelona, we stayed in this wonderful hotel! the service was great, Tina and José are very helpful, they gave us advices about places to go, and the one to avoid :) Thank you :)",
        "rating": 5,
        "place_name": "Barcelona Rooms 294",
        "place_category": "accommodation"
    },
    {
        "time": "2012-07-06",
        "text": "We spent 4 days in Barcelona. The room is great and people are nice. I advice you to go there if you go to Barcelona",
        "rating": 5,
        "place_name": "Barcelona Rooms 294",
        "place_category": "accommodation"
    },
    {
        "time": "2012-08-23",
        "text": "We spent 4 days in Barcelona. The room is great and people are nice. I advice you to go there if you go to Barcelona",
        "rating": 5,
        "place_name": "Barcelona Rooms 294",
        "place_category": "accommodation"
    },
    {
        "time": "2010-09-04",
        "text": "I had a nice stay in this hostel",
        "rating": 5,
        "place_name": "Barcelona Rooms 294",
        "place_category": "accommodation"
    },
    {
        "time": "2010-05-11",
        "text": "I enjoyed my stay since the moment I arrived at Hispano Siete Suiza Hotel in April 2010: the way I was received, the excellent family room, the greatly prepared staff able to answer all my questions. Besides that, the hotel is very well located, close to the amazing Sagrada Familia, to the public transportation, charming bakeries, cafes, fruit stores, and restaurants. There&#39;s something I will never forget abou my stay: at the airport, due to the aerial chaos, I was told I couldn&#39;t fly to Paris with my family as I had planned and then called to the hotel to check if we could return. They said they had no availability anymore but made arrangements for us to stay in a partner hotel. Among so much stress and disappointment with the unpredictible situation their help was fundamental; at that point finding a hotel in Barcelona seemed impossible. I am so thankful for all they did for me and my family. I strongly recommend this hotel and also their parter, Wilson Hotel, at Diagonal Ave.",
        "rating": 5,
        "place_name": "Hispanos 7 Suiza Apartament-Restaurant",
        "place_category": "accommodation"
    },
    {
        "time": "2012-05-30",
        "text": "For a budget accommodation in Barcelona, I would go with this option again (this, or a somewhat humbler Glory Facade Guesthouse, serviced by the same people). The rooms a clean, the people friendly, and the location is also great. Both of the guest houses are in private apartment buildings about a 20 minute walk away from the main tourist traps like La Ramba, with La Sagrada Familia and the Metro very close by. If you are looking for a solid breakfast or a private bathroom, this is not the place for you. Also, be very clear about the time you are arriving so that one of the people is there to give you the key.",
        "rating": 4,
        "place_name": "Padilla Guest House",
        "place_category": "accommodation"
    },
    {
        "time": "2013-05-29",
        "text": "Great place to stay when travelling with family. View of Sagrada familia from our balcony, metro only 2 minute walk to connect you to the rest of Barca.",
        "rating": 4,
        "place_name": "Sensation Apartments Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2013-10-27",
        "text": "Went here for a Thai Aroma massage. Must say I was surprised of the very professional staff and amazing massage! Really recommend it!",
        "rating": 5,
        "place_name": "Bangkok Healthy Spa",
        "place_category": "accommodation"
    },
    {
        "time": "2013-11-16",
        "text": "Great escape from a rainy day. Perfect service and friendly hosts.",
        "rating": 5,
        "place_name": "Bangkok Healthy Spa",
        "place_category": "accommodation"
    },
    {
        "time": "2011-01-17",
        "text": "Nice guys and great place!!",
        "rating": 5,
        "place_name": "Alcambarcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2013-11-07",
        "text": "Very good quality for its price. Almost feels like a hotel. Very friendly staff and many accommodations. I also liked how it&#39;s right next to the Clot metro station. Complimentary breakfast not much but better than nothing!",
        "rating": 5,
        "place_name": "Barcelona Urbany Hostel",
        "place_category": "accommodation"
    },
    {
        "time": "2013-09-30",
        "text": "This is a fantastic place with a great staff and very comfortable bed. Definitely stay here if you get the chance.",
        "rating": 5,
        "place_name": "Barcelona Urbany Hostel",
        "place_category": "accommodation"
    },
    {
        "time": "2013-05-12",
        "text": "The hostel is very clean and nice to stay in. The people are nice and helpful, the only thing is that the breakfast isn&#39;t great but its free.",
        "rating": 5,
        "place_name": "Barcelona Urbany Hostel",
        "place_category": "accommodation"
    },
    {
        "time": "2012-07-31",
        "text": "Fun and good people. Just have quiet hours.",
        "rating": 4,
        "place_name": "Sant Jordi Hostel Sagrada Familia",
        "place_category": "accommodation"
    },
    {
        "time": "2012-03-12",
        "text": "Great Hostel!!! Great Instalations, Great Staff, Great Atmosphere... Very modern and comfortable. I met tons of people and actually made some new friends. Be carefull though; If you pic the 1 bed, 2 bed or 4 bed rooms you will be put in the apartments that are in the same building but on the upper floors. The apartments are nice too, just not the great hostel atmosphere that you get in the downstairs hostel.",
        "rating": 5,
        "place_name": "Sant Jordi Hostel Sagrada Familia",
        "place_category": "accommodation"
    },
    {
        "time": "2013-06-25",
        "text": "Great Hostel to stay =) People there, stuff and clients, are amazing. Youthful atmosphere and during the nights there is always something to do with the people staying there. It was clean and tidy =) Congratulations! Un hostel genial =) La que gente allí, tanto los trabajadores como lo que se hospedan son geniales. Un ambiente juvenil y durante las noches siempre hay algún plan con la gente de allí. Además de que estaba limpio y ordenado =) Felicidades chicos! (Un beso a mi recepcionista preferido!)",
        "rating": 4,
        "place_name": "Sant Jordi Hostel Sagrada Familia",
        "place_category": "accommodation"
    },
    {
        "time": "2012-07-31",
        "text": "The Hotel is great. They have all the things that you&#39;d expect of a Hotel. The beds are not too comfortable, though they have a free internet connection, and a modern bathroom. The Hotel itself is close to the Clot Subway.",
        "rating": 4,
        "place_name": "Catalonia Albeniz",
        "place_category": "accommodation"
    },
    {
        "time": "2013-08-09",
        "text": "*** hotel very near to metro line L1 and have an excellent breakfast",
        "rating": 4,
        "place_name": "Catalonia Albeniz",
        "place_category": "accommodation"
    },
    {
        "time": "2010-12-01",
        "text": "I&#39;ve always enjoyed visiting the city of Barcelona for business. 987 Hotels allows my visits to be even more comfortable with free internet and free phone calls within the EU. This must be the leading business hotel in barcelona.",
        "rating": 5,
        "place_name": "987 Barcelona Hotel",
        "place_category": "accommodation"
    },
    {
        "time": "2013-09-16",
        "text": "So far so good. Very quiet neighborhood and people seem to know how to run the hotel. Very private. Didnt see much action happening around. Still not bad considering there is a convenience store right across the street and a moviestar cellularphone store around the corner. A few pinays working the hotel. Will confirm if laundromat is nearby.",
        "rating": 4,
        "place_name": "Catalonia Berna",
        "place_category": "accommodation"
    },
    {
        "time": "2012-08-26",
        "text": "Good hotel, nice rooms and clean. I suggest it.",
        "rating": 4,
        "place_name": "Hotel Aranea",
        "place_category": "accommodation"
    },
    {
        "time": "2013-06-06",
        "text": "Highly recommanded",
        "rating": 4,
        "place_name": "Hotel Aranea",
        "place_category": "accommodation"
    },
    {
        "time": "2011-12-03",
        "text": "Great",
        "rating": 5,
        "place_name": "Hotel Aranea",
        "place_category": "accommodation"
    },
    {
        "time": "2010-02-08",
        "text": "This hotel truly has a wonderful European Touch. The location is great and it is very close to the amazing public transportation in Barcelona. It is so easy and convenient getting around town and this hotel is located in a very good area. In addition, it is surrounded by small wonderful restaurants with incredible food. The rooms are small, but very urban in nature. You can see the life of the city from your room. It is very clean and cute. Do not expect a spacious room, but it has enough space. The breakfast was very good and convenient. The staff is very helpful with directions and attractions. Barcelona is beautiful and you should go! I recommend this hotel!",
        "rating": 4,
        "place_name": "Hotel Aranea",
        "place_category": "accommodation"
    },
    {
        "time": "2009-05-27",
        "text": "This is a great page where I could find all informationn that I needed about barcelona city when I was planning to go there and even when I was roaming the city it was very usefull. Id would like recommend this page to any one planning to go there or any one that is already there. Miguel",
        "rating": 5,
        "place_name": "Barcelona City Hotel (Hotel Universal)",
        "place_category": "accommodation"
    },
    {
        "time": "2009-05-27",
        "text": "Hi everbody, I was looking for luxury hotel and I found it here, all the hotels are 4 or 5 star, also at the city guide is very complete with many pictures and usefull information.",
        "rating": 5,
        "place_name": "Barcelona City Hotel (Hotel Universal)",
        "place_category": "accommodation"
    },
    {
        "time": "2009-06-03",
        "text": "Just got back from a trip to Barcelona in late May 2009. Stayed in a double room at the Praktik 3 nights. This is a great hotel, especially when you compare prices in the rest of Barcelona. The rooms are clean and modern (with excellent showers), but with some nice older touches (wooden window shutters, tile floors). Location was great - about a 10-15 minute walk to the top of the Ramblas, Girona Metro stop 1.5 blocks away. Neighborhood felt safe, even late at night, and the hotel seemed extremely secure. The staff was extremely courteous and helpful, providing recommendations, directions, etc. They are also excellent English-speakers. 1 computer with free internet access and a nice little 2nd-floor sunning deck were nice touches as well. A word of warning to anyone visiting Barcelona - wear a money belt. I was pick-pocketed in the Verdaguer Metro station on my way from the Sants train station to the hotel, probably 10 minutes in to my visit. Do not make the same mistake - wallets go inside your locked luggage before you get to Barcelona!",
        "rating": 4,
        "place_name": "The Praktik",
        "place_category": "accommodation"
    },
    {
        "time": "2010-11-25",
        "text": "it&#39;s cheap, clean, modern and very &quot;praktik&quot; :D",
        "rating": 5,
        "place_name": "The Praktik",
        "place_category": "accommodation"
    },
    {
        "time": "2010-01-28",
        "text": "i stayed by myself for 3 days! one and half block from Sangrada Familia, the Cathedral. i stayed in the single room. My room is very cozy and perfect for one person. SUPER clean bathroom, hot water anytime. it is very good location. Only 3-4 subway stops to the famous Rambla street from Sangrada Familia station. Also there is Information center right in front of Sangrada Familia that you could ask about direction to anywhere. i dont speak spanish at all but i had a GOOD TIME in this nice hotel. AH! there is supermarket next door and bigger one next block. Pharmacy is on every block. .. i usually comeback about 9-10 pm and not dangerous at all. with this price!!!! I HIGHLY recommand! I am serious!",
        "rating": 5,
        "place_name": "Hostemplo",
        "place_category": "accommodation"
    },
    {
        "time": "2013-11-24",
        "text": "The place is great but the team of the owners is the greatest one! Really nice guys!",
        "rating": 5,
        "place_name": "Hostal Boutique Khronos",
        "place_category": "accommodation"
    },
    {
        "time": "2011-09-02",
        "text": "Excellent Hostal, actually it is more like a HOTEL, We checked in late and there was a very nice guy expecting us and gave us all information about the city, the rooms were very comfortable, the outside terrace is amazing, location couldn´t be more perfect! Highly recommendable, and we are definitely staying there next time we go to barcelona!! Thanx Hostal Khronos!",
        "rating": 5,
        "place_name": "Hostal Boutique Khronos",
        "place_category": "accommodation"
    },
    {
        "time": "2013-12-14",
        "text": "We stayed here for four nights. The rooms were neely remodeled and very clean and well equipped (the shower pressure was amazing). The room includes a mini-fridge and an individual thermostat. The bed was king sized. The staff all spoke english and were very helpful with recommendations for food and sightseeing. If you fly in, take the A2 bus to Playa Espanya and then thr L3 Metro to Girona...a 5 minute walk and you are there.",
        "rating": 5,
        "place_name": "Hotel Europark",
        "place_category": "accommodation"
    },
    {
        "time": "2012-09-20",
        "text": "We stayed here for 5 days and we really like it! The room is modern design and quite spacious. The hotel is conveniently located near Passeig de Gracia station, where there are 3 major subway lines and the airport train R2 comes here as well. We walked to Sagra Familia, Las Ramblas, La Boqueria Market and Catalunya Plaza.The hotel has a tiny pool but it doesn&#39;t really do much. The terrace is a nice hangout spot though. The staff are very friendly and helpful. I would highly recommend staying at Euro-Park if you are looking for a good value hotel.",
        "rating": 5,
        "place_name": "Hotel Europark",
        "place_category": "accommodation"
    },
    {
        "time": "2011-04-05",
        "text": "Great price, great location.. small but clean rooms. Really enjoyed our stay.",
        "rating": 4,
        "place_name": "Hostal Felipe II",
        "place_category": "accommodation"
    },
    {
        "time": "2013-05-06",
        "text": "It&#39;s not the most luxurious hostel around but the communal spaces are really nice, great bathroom facilities, free internet and the reception staff and owner are the best you can find anywhere. I stayed in the hostel for a week when I moved to Barcelona and was looking for somewhere to live and they couldn&#39;t have been more helpful. LOVE IT",
        "rating": 4,
        "place_name": "Mediterranean Hostel Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2012-08-08",
        "text": "Such a great place that I recommend!! Everything was clean and very well organized!! What&#39;s more it&#39;s very close to the center, so that you can go everywhere walking. I&#39;ve met so many people, especially the very adorable staff!! They&#39;ve helped me and told me the most beautiful and funny places. To put it in the nutshell, I had a great time in this hostel and I will come back for sure. Thank you very much!!!",
        "rating": 5,
        "place_name": "Mediterranean Hostel Barcelona",
        "place_category": "accommodation"
    },
    {
        "time": "2011-03-24",
        "text": "The staff is lovely, the location is great, the rooms were very clean, everything was very nice and organized. An awesome sight for students and others to meet new people and just have a great time. Thank you very much!",
        "rating": 5,
        "place_name": "Mediterranean Hostel Barcelona",
        "place_category": "accommodation"
    }
]